{
    "https://jobs.ksl.com/listing/993685": {
        "name": "Junior/Mid Level Software Engineer - Deseret News",
        "employer": "Deseret News",
        "url": "https://jobs.ksl.com/listing/993685",
        "description": "Our company is committed to being trusted voices of light and truth reaching hundreds of millions of people worldwide.\n\nThe Deseret News is currently seeking a junior/mid level Software Engineer to work on the Deseret News software development team. The company’s websites and mobile apps continue the strong legacy of providing online news and information nationwide, and we will continue to elevate and illuminate our readers as we expand our journalism to meet them wherever they are. \n\nThis Software Engineer will be responsible for development, and maintenance of technology for parts of deseret.com and other related web sites and apps. The ideal candidate needs to have experience with high traffic websites, excellent communication skills, and be willing and excited to learn new skills and technologies.\n\nPrimarily our core languages used are Javascript and PHP. We use graphql for our API's and use react for most of our interactive frontend. Most of our infrastructure is hosted with AWS. We used a combination of Docker hosted on the fargate managed instances of AWS's ECS service. Our data is housed in a combination of MySQL and PgSQL databases. If this sounds like a stack you would like to work with then you may be a good candidate for the position!\n\nAt a minimum, you’re a candidate if you can demonstrate:\n\n- 3-5 years of current experience with web software development technologies and tools including:\n\n- JavaScript, HTML, CSS, PHP, MySQL/PgSQL.\n\n- Self motivated to learn new and emerging technologies\n\n- Must be a strong team and individual motivator with a positive attitude who enjoys working with others. Ability to work independently in addition to collaborative work on large projects with team members, including stakeholders, product owners, designers, and other developers\n\n- Goal-oriented person with high personal drive, integrity, and energy\n\n- Excellent written and verbal communication\n\nAn ideal candidate will have:\n\n- Experience working with Javascript frameworks, namely NextJS and Express\n\n- Experience working with front end technologies. IE React.js\n\n- An understanding of best practices and design principles as it pertains to architecting web applications.\n\n- Experience working with GraphQL and REST API’s\n\n- Experience working with source control, specifically GIT\n\nIt’s a bonus if you have:\n\n- Experience working with PHP and MVC frameworks, namely Symfony\n\n- Experience developing within a virtualized environment using docker\n\n- Experience working with asset management systems like npm and composer. Using transpilers for frontend assets like webpack, babel, and using SCSS for styles\n\n- Experience working with Agile/Scrum methodology and use of project/story tracking software (Clubhouse, JIRA, Trello or similar)\n\n- Experience optimizing and working with high traffic web sites using caching and scalability technologies\n\nA day in the life:\n\nA typical day as a junior software engineer with Deseret News will start out with a morning standup where the team will meet and discuss our progress made from the day before. We will work through any impediments that have come up and set a game plan for the day. From there you will continue to pull work from our current sprint and work to complete the stories that our product director and team has prioritized for this sprint. A portion of your time may be spent pairing with a senior developer. Taking turns being in the driver seat and being the observer to complete stories. If you get stuck on solving a problem the rest of the team is there as a resource to help. At the end of a sprint you may be asked to demo some of the work that you completed to our stakeholders within the company.\n\nOur team\n\nYou will join an energetic group of colleagues who aspire to the best processes for development that fit our team. Our team members don't take themselves too seriously, but we are serious about working together as digital innovators.\n\nOur culture\n\nCulture is a very important part of the Deseret News Publishing Company. We look for people who exhibit and exemplify our Cultural Beliefs:\n\n- Think Audience — I understand and engage our audiences.\n\n- Build Trust — I share my best, respect my colleagues and expect others to do the same.\n\n- Be One — I collaborate to build a unified, world-class team.\n\n- Align Daily — I align my efforts daily with our Key Results.\n\n- Own It — I continually ask, “What else can I do to achieve our results?” and refuse to blame others.\n\n- Go Big — I inform and influence the world in a way no one else does.\n\nOur company\n\nThe Deseret News is Utah’s oldest newspaper and the Beehive state’s longest continuously-operating business. Our primary focus is digital and our reach is national and global with over half of our online readers living outside of Utah.\n\nFor more information, or to apply now, you must go to the website below. Please DO NOT email your resume to us as we only accept applications through our website.\n\nhttps://deseretmanagement.wd1.myworkdayjobs.com/DeseretNews/job/SLC-Triad-Center/Junior-Mid-Level-Software-Engineer---Deseret-News_R5498-1"
    },
    "https://jobs.ksl.com/listing/994255": {
        "name": "Programmer/Analyst (PRN34957B)",
        "employer": "University of Utah",
        "url": "https://jobs.ksl.com/listing/994255",
        "description": "We seek a SharePoint Developer to join our team. This position will develop and maintain enterprise solutions for the University of Utah Health intranet and help plan and execute tasks related to a new intranet/employee portal initiative. You will work closely with a team of business analysts and U of U employees to assess the needs of various business lines and develop web solutions, custom forms, workflows, and applications to help optimize efficiency.\n\nUniversity of Utah Job ID# PRN34957B 01555 - UIT INFRASTRUCTURE & OPS\n\nCOMPENSATION: $80,000/yr. - $85,000/yr.\n\nWORK SCHEDULE: after hours and on-call work required"
    },
    "https://jobs.ksl.com/listing/968739": {
        "name": "ORAL SURGERY - PUBLIC RELATIONS AND REFERRAL DEVELOPER",
        "employer": "The Oral  and Facial Surgery Center",
        "url": "https://jobs.ksl.com/listing/968739",
        "description": "We are looking for a bright, friendly, organized and detail-oriented person to help manage referral projects and patient flow increase in our busy oral surgery company. You will develop creative ways to visit these offices often to deepen and strengthen their relationship with our practice. In many ways, our clients will see you as the day-to-day face of our company (we have a wonderful reputation in the industry for being responsive and friendly). This position is based in Clearfield, Utah, Monday through Thursday, 8:30am to 5pm. You will work in office and prepare deliveries and events. You will also travel to different referring offices that span from Ogden to Centerville. You will also be in charge of finding and developing new referrals.\n\nWe will train you on our management software we use, but are also hoping you have the following skills and experience:\n\n- Comfortable using and learning software\n\n- Solid organizational and record-keeping skills\n\n- Time management skills are a must\n\n- Excellent memory\n\n- Great phone voice\n\n- Exceptional verbal and written skills\n\n- Good with Microsoft Office and Google Docs,Google Spreadsheets, etc\n\n- Previous customer service experience\n\n- Ability to work with different personalities\n\n- Project management experience is a plus\n\nWe also hope you match these descriptors:\n\n- Detailed and punctual\n\n- Friendly\n\n- Good sense of humor\n\n- Positive attitude\n\n- A team-player mindset\n\n- Energetic and enthusiastic\n\nWe are a small, tight-knit group who really enjoy working together. Professional but Fun.\n\nPlease include in your cover letter why you think you are an excellent fit for this position. We look forward to meeting you"
    },
    "https://jobs.ksl.com/listing/933960": {
        "name": "Web Developer",
        "employer": "GOLDPoint Systems",
        "url": "https://jobs.ksl.com/listing/933960",
        "description": "Company Description:\n\nFor more than ten years, GOLDPoint Systems has been at the forefront of the lending industry - now known as #fintech. Our fully customizable products allow lending institutions of all types to grow and increase their revenue. Ultimately, we make our clients’ money. GOLDPoint has more than 30 clients and over 100 employees and we are growing every day. Come join our teams and grow with us!"
    },
    "https://jobs.ksl.com/listing/993239": {
        "name": "Software Sales Professional",
        "employer": "Innovative Market Analysis",
        "url": "https://jobs.ksl.com/listing/993239",
        "description": "We are in immediate need of a Software Sales Executive in our Taylorsville, Utah Office.\n\nPrimary Role: As a Sales Executive your primary role will be to sell MetaStock products and solutions to individual traders around the globe. This position is responsible for generating recurring and once-off sales. The Sales Executive is provided revenue opportunities through inbound calls, chats, emails, and outbound calls. Many warm leads are provided. There are no “cold” calls.\n\nMetaStock develops the award-winning MetaStock range of products, which are designed to help customers trade more successfully. Visit our website to learn about our exciting range of products and tools at www.metastock.com.\n\nMetaStock prides itself on a low employee turnover rate, good work-life balance, and company culture. Our average employee has been here for over 10 years. As a member of our sales team, you will be given paid time off. We even prorate commission for time off.\n\nSales reps also enjoy a competitive base salary, uncapped commissions, bonuses on company performance, paid time off, health insurance, and a generous 401 K match. \n\nWe are looking for motivated, self-starters to grow with us."
    },
    "https://jobs.ksl.com/listing/993684": {
        "name": "Software Engineering Manager - Deseret News",
        "employer": "Deseret News",
        "url": "https://jobs.ksl.com/listing/993684",
        "description": "Our company is committed to being trusted voices of light and truth reaching hundreds of millions of people worldwide.\n\nThe Deseret News seeks a software engineering manager. In addition to leading and mentoring our developers and QA engineers, this position will assist in making infrastructure-level decisions and participate in day-to-day development. Successful candidates will have experience with a variety of software development technologies and aren’t afraid to jump in and learn more. This position will report to the head digital officer.\n\nThe Deseret News websites (Deseret.com, TheChurchNews.com, etc.) and mobile apps continue the strong legacy of providing online news and information nationwide, and we will continue to elevate and illuminate our readers as we expand our journalism to meet them wherever they are. \n\nPrimarily languages used are Javascript and PHP. We use graphql for our APIs and React for most of our interactive frontends. Most of our infrastructure is hosted with AWS. We used a combination of Docker containers hosted on fargate managed instances and some stand alone EC2 servers. Our data is housed in a combination of MySQL and PgSQL databases. If this sounds like a stack you would like to work with then you may be a good candidate for the position!\n\nWhile this position is a management position there is the expectation that you will directly help the team develop new features and maintain the existing stack.\n\nAt a minimum, you’re a candidate if you can demonstrate:\n\n- 3 or more years of experience managing people, ideally developers.\n\n- 6 or more years of current experience with web software development technologies and tools.\n\n- You are self-motivated to learn new and emerging technologies.\n\n- You are a strong team and individual motivator with a positive attitude who enjoys working with others.\n\n- You have the ability to work both independently and collaboratively on large projects with team members, including stakeholders, product owners, designers and other developers.\n\n- Experience maintaining existing enterprise web applications.\n\n- Excellent written and verbal communication skills.\n\n- Experience optimizing and working with high traffic web sites using caching and scalability technologies.\n\nAn ideal candidate will have:\n\n- Experience working with PHP MVC frameworks, namely Symfony.\n\n- Experience working with front end technologies: React.js and ES6+.\n\n- An understanding of best practices and design principles as they pertain to architecting web applications.\n\n- Experience working with consuming and writing GraphQL and REST APIs.\n\n- Experience working with source control, specifically GIT.\n\n- Experience developing within a virtualized environment using docker.\n\n- Experience working with AWS and managing infrastructure as code with services like Terraform, Chef, Puppet or Ansible.\n\n- Experience working with Agile/Scrum methodology and use of project/story tracking software (Shortcut, JIRA, Trello or similar)\n\nOur team\n\nYou will join an energetic group of colleagues who aspire to the best processes for development that fit our team. Our team members don't take themselves too seriously, but we are serious about working together as digital innovators.\n\nOur culture\n\nCulture is a very important part of the Deseret News Publishing Company. We look for people who exhibit and exemplify our Cultural Beliefs:\n\n- Think Audience — I understand and engage our audiences.\n\n- Build Trust — I share my best, respect my colleagues and expect others to do the same.\n\n- Be One — I collaborate to build a unified, world-class team.\n\n- Align Daily — I align my efforts daily with our Key Results.\n\n- Own It — I continually ask, \"What else can I do to achieve our results?\" and refuse to blame others.\n\n- Go Big — I inform and influence the world in a way no one else does.\n\nOur company\n\nThe Deseret News is Utah's oldest newspaper and the Beehive state's longest continuously-operating business. Our primary focus is digital and our reach is national and global with over half of our online readers living outside of Utah.\n\nFor more information, or to apply now, you must go to the website below. Please DO NOT email your resume to us as we only accept applications through our website.\n\nhttps://deseretmanagement.wd1.myworkdayjobs.com/DeseretNews/job/SLC-Triad-Center/Software-Engineering-Manager---Deseret-News_R5497"
    },
    "https://jobs.ksl.com/listing/933997": {
        "name": "Electrical Engineer / Developer",
        "employer": "Monnit",
        "url": "https://jobs.ksl.com/listing/933997",
        "description": "Monnit, the global IoT industry leader in remote monitoring solutions, is looking for a full-time Electrical Engineer/Developer with a desire to design and develop Monnit's leading hardware and software solutions. This job is located in our corporate headquarters in South Salt Lake. If you are a dynamic self-starter, motivated, like to win, and you're a team player who works well in a collaborative environment, keep reading!"
    },
    "https://jobs.ksl.com/listing/993962": {
        "name": "Associate Web Developer & Graphic Artist",
        "employer": "Weber State University",
        "url": "https://jobs.ksl.com/listing/993962",
        "description": "Associate Web Developer & Graphic Artist\n\n \n\nRequisition Number: S01459P:\n\n \n\nPosition Category: Staff\n\n \n\nCampus Location: Weber State University - Ogden, UT\n\n \n\nHours Per Week: 40\n\n \n\nMonths Per Year: 12\n\n \n\nAlternate Work Schedule: Working remotely may be available.\n\n \n\nPay Grade: N27\n\n \n\nSalary:\n\n \n\nHourly Pay Rate:\n\n \n\nFLSA: Non-Exempt\n\n \n\nJob Summary/Basic Function:\n\n \n\nThe Associate Web Developer & Graphic Artist supports the design, development, maintenance, and assessment of the Stewart Library's web presence and provides professional digital design services for all aspects of library needs.\n\n \n\nReporting to the Library's Systems Administrator, the Associate Web Developer & Graphic Artist joins modern website development with artistic vision as-well-as assist library faculty and staff with website authoring, content management, and general content management assistance.\n\n \n\nThe Associate Web Developer & Graphic Artist, working closely with the senior developer, will develop and document authoring guidelines and workflows, standards and procedures, and perform usability assessment studies in concert with the library's Website Committee.\n\n \n\nRequired Qualifications:\n\n \n\nAssociates degree or equivalent experience in related field.\n\n \n\n6 months full-time experience or the equivalent combination of education and experience (1 year of part time experience would count as 6 months of full time experience), designing and developing websites using HTML 5, CSS3, JQuery or other related web developing languages.\n\n \n\nPreferred Qualifications:\n\n \n\nOne-year professional experience designing and developing websites that meet professional standards of quality, including responsive design and user experience best practices.\n\n \n\nArtistic skill and the ability to design complex and simple digital graphics that convey meaning and aesthetically enhance web media.\n\n \n\nBachelor’s degree in relevant field.\n\n \n\nExcellent customer service; ability to work productively both alone and in a team environment. Strong written and verbal communication skills, along with strong interpersonal skills.\n\n \n\nExperience in maintaining websites in a content management system.\n\n \n\nExperience with current Adobe Cloud programs relating to web development or design. (Photoshop, InDesign, Illustrator, etc.)\n\n \n\nComfortable working in a Linux command line environment.\n\n \n\nWorking with virtual machines and Docker environment.\n\n \n\nFamiliarity developing with Github, SASS and BeHat.\n\n \n\nBackground Check? Yes\n\n \n\nBenefits Summary:\n\n \n\nWSU offers a generous benefits package that includes medical, dental, long-term disability, life insurance, retirement, a wellness program with release time and paid incentives, tuition benefits, free tickets to athletic and performing arts events, and paid holidays, vacation, and sick leave.\n\n \n\nJob Open Date: 05/10/2023\n\n \n\nReview Date: 05/20/2023\n\n \n\nJob Close Date:\n\n \n\nOpen Until Filled: Yes\n\n \n\nNotes to Applicant:\n\n \n\nThe annual salary for this position starts at $40,000 and may go up from there depending on candidate qualifications. The position comes with a generous https://www.weber.edu/wsuimages/HumanResources/Benefits%20Overview/Non-%20Exempt%20Benefits%202023-24.pdf.\n\n \n\nTo apply, please complete the online application and attach a cover letter, current resume, portfolio, and the names and contact information for three professional references.\n\n \n\nFor qualification determination, your application and/or resume must address the required and preferred qualifications and must contain average number of hours worked per week and the dates of employment (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application may be considered incomplete.\n\n \n\nScreening of applications will begin May 20, 2023. Position will remain open until filled.\n\n \n\nCriminal background check required as a condition of employment.\n\n \n\nPhysical Activity of this position: Expressing or exchanging ideas. Those activities in which they must convey detailed or important instructions to other workers accurately or quickly. , Ability to receive detailed information with or without assistance., Repetitive motion. Substantial movements (motions) of the wrists, hands, and/or fingers.\n\n \n\nPhysical Requirements of this position: Sedentary work. Exerting up to 10 pounds of force occasionally and/or negligible amount of force frequently or consistently to move objects, including the human body. Sitting most of the time. Walking and standing only occasionally if ever.\n\n \n\nVisual Acuity Requirements including color, depth perception and field of vision: Required to perform activities such as preparing and analyzing data and figures; transcribing; using a computer terminal; extensive reading.\n\n \n\nThe conditions the worker will be subject to in this position: None. The worker is not substantially exposed to adverse environmental conditions (such as in typical office or administrative work).\n\n \n\nTo apply, visit https://apptrkr.com/4177066\n\n \n\nCopyright ©2022 Jobelephant.com Inc. All rights reserved.\n\n \n\nhttps://www.jobelephant.com/\n\njeid-e9c2ba11e4fd16498f1026e050a82a3b"
    }
}